gpu/rapidcfd/cases/clean_a18/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0488412;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0488412;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0488412;
        value           uniform 0.0488412;
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    sideLeft
    {
        type            slip;
    }

    sideRight
    {
        type            slip;
    }

    wing
    {
        type            kqRWallFunction;
        value           uniform 0.0488412;
    }

}
